cmsis-svd/cmsis-svd/data/Cypress/psoc63.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FAULT</name>
      <description>Fault structures</description>
      <baseAddress>0x40220000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>256</dimIncrement>
          <name>STRUCT[%s]</name>
          <description>Fault structure</description>
          <addressOffset>0x00000000</addressOffset>
          <register>
            <name>CTL</name>
            <description>Fault control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>TR_EN</name>
                <description>Trigger output enable:
'0': Disabled. The trigger output 'tr_fault' is '0'.
'1': Enabled. The trigger output 'tr_fault' reflects STATUS.VALID. The trigger can be used to initiate a Datawire transfer of the FAULT data (FAULT_DATA0 through FAULT_DATA3).</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EN</name>
                <description>IO output signal enable:
'0': Disabled. The IO output signal 'fault_out' is '0'. The IO output enable signal 'fault_out_en' is '0'.
'1': Enabled. The IO output signal 'fault_out' reflects STATUS.VALID. The IO output enable signal 'fault_out_en' is '1'.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESET_REQ_EN</name>
                <description>Reset request enable:
'0': Disabled.
'1': Enabled. The output reset request signal 'fault_reset_req' reflects STATUS.VALID. This reset causes a warm/soft/core reset. This warm/soft/core reset does not affect the fault logic STATUS, DATA0, ..., DATA3 registers (allowing for post soft reset failure analysis).

The 'fault_reset_req' signals of the individual fault report structures are combined (logically OR'd) into a single SRSS 'fault_reset_req' signal.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Fault status</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x80000000</resetMask>
            <fields>
              <field>
                <name>IDX</name>
                <description>The fault source index for which fault information is captured in DATA0 through DATA3. The fault information is fault source specific and described below.

Note: this register field (and associated fault source data in DATA0 through DATA3) should only be considered valid, when VALID is '1'.</description>
                <bitRange>[6:0]</bitRange>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MPU_0</name>
                    <description>Bus master 0 MPU/SMPU.
DATA0[31:0]: Violating address.
DATA1[0]: User read.
DATA1[1]: User write.
DATA1[2]: User execute.
DATA1[3]: Privileged read.
DATA1[4]: Privileged write.
DATA1[5]: Privileged execute.
DATA1[6]: Non-secure.
DATA1[11:8]: Master identifier.
DATA1[15:12]: Protection context identifier.
DATA1[31]: '0' MPU violation; '1': SMPU violation.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_1</name>
                    <description>Bus master 1 MPU. See MPU_0 description.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_2</name>
                    <description>Bus master 2 MPU. See MPU_0 description.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_3</name>
                    <description>Bus master 3 MPU. See MPU_0 description.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_4</name>
                    <description>Bus master 4 MPU. See MPU_0 description.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_5</name>
                    <description>Bus master 5 MPU. See MPU_0 description.</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_6</name>
                    <description>Bus master 6 MPU. See MPU_0 description.</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_7</name>
                    <description>Bus master 7 MPU. See MPU_0 description.</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_8</name>
                    <description>Bus master 8 MPU. See MPU_0 description.</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_9</name>
                    <description>Bus master 9 MPU. See MPU_0 description.</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_10</name>
                    <description>Bus master 10 MPU. See MPU_0 description.</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_11</name>
                    <description>Bus master 11 MPU. See MPU_0 description.</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_12</name>
                    <description>Bus master 12 MPU. See MPU_0 description.</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_13</name>
                    <description>Bus master 13 MPU. See MPU_0 description.</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_14</name>
                    <description>Bus master 14 MPU. See MPU_0 description.</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_15</name>
                    <description>Bus master 15 MPU. See MPU_0 description.</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CM4_SYS_MPU</name>
                    <description>CM4 system bus AHB-Lite interface MPU. See MPU_0 description.</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_0</name>
                    <description>Peripheral master interface 0 PPU.
DATA0[31:0]: Violating address.
DATA1[0]: User read.
DATA1[1]: User write.
DATA1[2]: User execute.
DATA1[3]: Privileged read.
DATA1[4]: Privileged write.
DATA1[5]: Privileged execute.
DATA1[6]: Non-secure.
DATA1[11:8]: Master identifier.
DATA1[15:12]: Protection context identifier.
DATA1[31]: '0': PPU violation, '1': peripheral bus error.</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_1</name>
                    <description>Peripheral master interface 0 PPU. See MS_PPU_0 description.</description>
                    <value>29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_2</name>
                    <description>Peripheral master interface 1 PPU. See MS_PPU_0 description.</description>
                    <value>30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_3</name>
                    <description>Peripheral master interface 2 PPU. See MS_PPU_0 description.</description>
                    <value>31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_0</name>
                    <description>Peripheral group 0 PPU.
DATA0[31:0]: Violating address.
DATA1[0]: User read.
DATA1[1]: User write.
DATA1[2]: User execute.
DATA1[3]: Privileged read.
DATA1[4]: Privileged write.
DATA1[5]: Privileged execute.
DATA1[6]: Non-secure.
DATA1[11:8]: Master identifier.
DATA1[15:12]: Protection context identifier.
DATA1[31:30]: '0': PPU violation, '1': timeout detected, '2': peripheral bus error.</description>
                    <value>32</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_1</name>
                    <description>Peripheral group 1 PPU. See GROUP_PPU_0 description.</description>
                    <value>33</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_2</name>
                    <description>Peripheral group 2 PPU. See GROUP_PPU_0 description.</description>
                    <value>34</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_3</name>
                    <description>Peripheral group 3 PPU. See GROUP_PPU_0 description.</description>
                    <value>35</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_4</name>
                    <description>Peripheral group 4 PPU. See GROUP_PPU_0 description.</description>
                    <value>36</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_5</name>
                    <description>Peripheral group 5 PPU. See GROUP_PPU_0 description.</description>
                    <value>37</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_6</name>
                    <description>Peripheral group 6 PPU. See GROUP_PPU_0 description.</description>
                    <value>38</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_7</name>
                    <description>Peripheral group 7 PPU. See GROUP_PPU_0 description.</description>
                    <value>39</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_8</name>
                    <description>Peripheral group 8 PPU. See GROUP_PPU_0 description.</description>
                    <value>40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_9</name>
                    <description>Peripheral group 9 PPU. See GROUP_PPU_0 description.</description>
                    <value>41</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_10</name>
                    <description>Peripheral group 10 PPU. See GROUP_PPU_0 description.</description>
                    <value>42</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_11</name>
                    <description>Peripheral group 11 PPU. See GROUP_PPU_0 description.</description>
                    <value>43</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_12</name>
                    <description>Peripheral group 12 PPU. See GROUP_PPU_0 description.</description>
                    <value>44</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_13</name>
                    <description>Peripheral group 13 PPU. See GROUP_PPU_0 description.</description>
                    <value>45</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_14</name>
                    <description>Peripheral group 14 PPU. See GROUP_PPU_0 description.</description>
                    <value>46</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_PPU_15</name>
                    <description>Peripheral group 15 PPU. See GROUP_PPU_0 description.</description>
                    <value>47</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_MAIN_BUS_ERROR</name>
                    <description>Flash controller, main interface, bus error:
FAULT_DATA0[31:0]: Violating address.
FAULT_DATA1[31]: '0': FLASH macro interface bus error; '1': memory hole.
FAULT_DATA1[15:12]: Protection context identifier.
FAULT_DATA1[11:8]: Master identifier.</description>
                    <value>50</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VALID</name>
                <description>Valid indication:
'0': Invalid.
'1': Valid. HW sets this field to '1' when new fault source data is captured. New fault source data is ONLY captured when VALID is '0'. SW can clear this field to '0' when the fault is handled (by SW).</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Fault data</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Captured fault source data. 

Note: the fault source index STATUS.IDX specifies the format of the DATA registers.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PENDING0</name>
            <description>Fault pending 0</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>SOURCE</name>
                <description>This field specifies the following sources:
Bit 0: CM0 MPU.
Bit 1: CRYPTO MPU.
Bit 2: DW 0 MPU.
Bit 3: DW 1 MPU.
...
Bit 14: CM4 code bus MPU.
Bit 15: DAP MPU.
Bit 16: CM4 s+G92ystem bus MPU.


Bit 28: Peripheral master interface 0 PPU. 
Bit 29: Peripheral master interface 1 PPU. 
Bit 30: Peripheral master interface 2 PPU. 
Bit 31: Peripheral master interface 3 PPU.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PENDING1</name>
            <description>Fault pending 1</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>SOURCE</name>
                <description>This field specifies the following sources:
Bit 0: Peripheral group 0 PPU.
Bit 1: Peripheral group 1 PPU.
Bit 2: Peripheral group 2 PPU.
Bit 3: Peripheral group 3 PPU.
Bit 4: Peripheral group 4 PPU.
Bit 5: Peripheral group 5 PPU.
Bit 6: Peripheral group 6 PPU.
Bit 7: Peripheral group 7 PPU.
...
Bit 15: Peripheral group 15 PPU.

Bit 18: Flash controller, main interface, bus error.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PENDING2</name>
            <description>Fault pending 2</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>SOURCE</name>
                <description>This field specifies the following sources:
Bit 0 - 31: TBD.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MASK0</name>
            <description>Fault mask 0</description>
            <addressOffset>0x50</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SOURCE</name>
                <description>Fault source enables:
Bits 31-0: Fault sources 31 to 0.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MASK1</name>
            <description>Fault mask 1</description>
            <addressOffset>0x54</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SOURCE</name>
                <description>Fault source enables:
Bits 31-0: Fault sources 63 to 32.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MASK2</name>
            <description>Fault mask 2</description>
            <addressOffset>0x58</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SOURCE</name>
                <description>Fault source enables:
Bits 31-0: Fault sources 95 to 64.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR</name>
            <description>Interrupt</description>
            <addressOffset>0xC0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>FAULT</name>
                <description>This interrupt cause field is activated (HW sets the field to '1') when an enabled (MASK0/MASK1/MASK2) pending fault source is captured:
- STATUS.VALID is set to '1'.
- STATUS.IDX specifies the fault source index.
- DATA0 through DATA3 captures the fault source dara.

