cmsis-svd/cmsis-svd/data/Cypress/psoc63.svd
          <register>
            <name>INTR_MASK</name>
            <description>Master interrupt mask register.</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F1F01</resetMask>
            <fields>
              <field>
                <name>RCB_DONE</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_TRIGGER</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_NOT_FULL</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_EMPTY</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_OVERFLOW</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_UNDERFLOW</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_TRIGGER</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_NOT_EMPTY</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_FULL</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_OVERFLOW</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_UNDERFLOW</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASKED</name>
            <description>Master interrupt masked request register</description>
            <addressOffset>0x4C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F1F01</resetMask>
            <fields>
              <field>
                <name>RCB_DONE</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_TRIGGER</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_NOT_FULL</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_EMPTY</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_OVERFLOW</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_UNDERFLOW</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_TRIGGER</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_NOT_EMPTY</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_FULL</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_OVERFLOW</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_UNDERFLOW</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[20:20]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <cluster>
            <name>RCBLL</name>
            <description>Radio Control Bus (RCB) &amp; Link Layer controller</description>
            <addressOffset>0x00000100</addressOffset>
            <register>
              <name>CTRL</name>
              <description>RCB LL control register.</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x3F</resetMask>
              <fields>
                <field>
                  <name>RCBLL_CTRL</name>
                  <description>N/A</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>RCBLL_CPU_REQ</name>
                  <description>N/A</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CPU_SINGLE_WRITE</name>
                  <description>N/A</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CPU_SINGLE_READ</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>ALLOW_CPU_ACCESS_TX_RX</name>
                  <description>N/A</description>
                  <bitRange>[4:4]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>ENABLE_RADIO_BOD</name>
                  <description>N/A</description>
                  <bitRange>[5:5]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR</name>
              <description>Master interrupt request register.</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xD</resetMask>
              <fields>
                <field>
                  <name>RCB_LL_DONE</name>
                  <description>RCB_LL is done and the access is given back to CPU</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SINGLE_WRITE_DONE</name>
                  <description>N/A</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SINGLE_READ_DONE</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_SET</name>
              <description>Master interrupt set request register</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xD</resetMask>
              <fields>
                <field>
                  <name>RCB_LL_DONE</name>
                  <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SINGLE_WRITE_DONE</name>
                  <description>N/A</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SINGLE_READ_DONE</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_MASK</name>
              <description>Master interrupt mask register.</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xD</resetMask>
              <fields>
                <field>
                  <name>RCB_LL_DONE</name>
                  <description>Mask bit for corresponding bit in interrupt request register.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SINGLE_WRITE_DONE</name>
                  <description>N/A</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SINGLE_READ_DONE</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_MASKED</name>
              <description>Master interrupt masked request register</description>
              <addressOffset>0x1C</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xD</resetMask>
              <fields>
                <field>
                  <name>RCB_LL_DONE</name>
                  <description>Logical and of corresponding request and mask bits.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SINGLE_WRITE_DONE</name>
                  <description>N/A</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SINGLE_READ_DONE</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RADIO_REG1_ADDR</name>
              <description>Address of Register#1 in Radio  (MDON)</description>
              <addressOffset>0x20</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x1E02</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>REG_ADDR</name>
                  <description>N/A</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RADIO_REG2_ADDR</name>
              <description>Address of Register#2 in Radio  (RSSI)</description>
              <addressOffset>0x24</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0xA03</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>REG_ADDR</name>
                  <description>N/A</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RADIO_REG3_ADDR</name>
              <description>Address of Register#3 in Radio  (ACCL)</description>
              <addressOffset>0x28</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x824</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>REG_ADDR</name>
                  <description>N/A</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RADIO_REG4_ADDR</name>
              <description>Address of Register#4 in Radio  (ACCH)</description>
              <addressOffset>0x2C</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x823</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>REG_ADDR</name>
                  <description>N/A</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RADIO_REG5_ADDR</name>
              <description>Address of Register#5 in Radio  (RSSI ENERGY)</description>
              <addressOffset>0x30</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0xA03</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>REG_ADDR</name>
                  <description>N/A</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>CPU_WRITE_REG</name>
              <description>N/A</description>
              <addressOffset>0x40</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>ADDR</name>
                  <description>N/A</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>WRITE_DATA</name>
                  <description>N/A</description>
                  <bitRange>[31:16]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>CPU_READ_REG</name>
              <description>N/A</description>
              <addressOffset>0x44</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>ADDR</name>
                  <description>N/A</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>READ_DATA</name>
                  <description>N/A</description>
                  <bitRange>[31:16]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>BLELL</name>
          <description>Bluetooth Low Energy Link Layer</description>
          <addressOffset>0x00001000</addressOffset>
          <register>
            <name>COMMAND_REGISTER</name>
            <description>Instruction Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>COMMAND</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENT_INTR</name>
            <description>Event(Interrupt) status and Clear register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>ADV_INTR</name>
                <description>Advertiser interrupt. If bit is set to 1, it indicates an event occurred in the advertising procedure. The source of the event needs to be read from the ADV_INTR register.  
This bit is cleared, when firmware clears ALL interrupts by writing to the ADV_INTR register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SCAN_INTR</name>
                <description>Scanner interrupt.  If bit is set to 1, it indicates an event occurred in the scanning procedure. The source of the event needs to be read from the SCAN_INTR register.   
This bit is cleared, when firmware clears ALL interrupts by writing to the SCAN_INTR register.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INIT_INTR</name>
                <description>Initiator interrupt.  If bit is set to 1, it indicates an event occurred in the initiating procedure. The source of the event needs to be read from the INIT_INTR register.   
This bit is cleared, when firmware clears ALL interrupts by writing to the INIT_INTR register.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CONN_INTR</name>
                <description>Connection interrupt.  If bit is set to 1, it indicates an event occurred in the connection operation. This interrupt is aggregation of interrupts for all the connections. The source of the event for the specific connection, needs to be read from the CONN_INTR register specific to the connection. This bit is cleared, when firmware clears ALL interrupts by writing to the CONN_INTR register.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM_INTR</name>
                <description>Read: Sleep-mode-exit interrupt. This bit is set, when link layer hardware exits from sleep mode. 
Write: Clear sleep-mode-exit interrupt. Write to the register with this bit set to 1, clears the interrupt source. 
This interrupt is deprecated and should not be used.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_INTR</name>
                <description>Read: Deep sleep mode exit interrupt. This bit is set, when link layer hardware exits from deep sleep mode. 
Write: Clear deep sleep mode exit interrupt. Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENC_INTR</name>
                <description>Encryption module interrupt. 
This interrupt id deprecated and should not be used</description>
                <bitRange>[6:6]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RSSI_RX_DONE_INTR</name>
                <description>RSSI RX done interrupt.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
