cmsis-svd/cmsis-svd/data/Cypress/psoc63.svd
          <register>
            <name>NEXT_SUP_TO_STATUS</name>
            <description>Next Supervision timeout Status</description>
            <addressOffset>0x14024</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>NEXT_SUP_TO</name>
                <description>HW updates this register for the SuperVision timeout next instant, granularity is 625us</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_CONN_STATUS</name>
            <description>Connection Status</description>
            <addressOffset>0x14028</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CURR_CONN_INDEX</name>
                <description>Connection Index that was serviced. Legal values are 0,1,2,3.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CURR_CONN_TYPE</name>
                <description>Connection type
1 - Master Connection
0 - Slave Connection</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SN_CURR</name>
                <description>Sequence Number of Packets exchanged</description>
                <bitRange>[6:6]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>NESN_CURR</name>
                <description>Next Sequence Number</description>
                <bitRange>[7:7]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>LAST_UNMAPPED_CHANNEL</name>
                <description>Last Unmapped Channel</description>
                <bitRange>[13:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PKT_MISS</name>
                <description>1 - Packet Missed
0 - Connection exchanged packets</description>
                <bitRange>[14:14]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ANCHOR_PT_STATE</name>
                <description>Anchor Point State
0 - Anchor point missed
1 - Anchor point established</description>
                <bitRange>[15:15]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BT_SLOT_CAPT_STATUS</name>
            <description>BT Slot Captured Status</description>
            <addressOffset>0x1402C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>BT_SLOT</name>
                <description>During slave connection event, HW updates this register with the captured BT_SLOT at anchor point, granularity is 625us</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>US_CAPT_STATUS</name>
            <description>Micro-second Capture Status</description>
            <addressOffset>0x14030</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>US_CAPT</name>
                <description>During slave connection event, HW updates this register with the captured microsecond at anchor point, granularity is 1us</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>US_OFFSET_STATUS</name>
            <description>Micro-second Offset Status</description>
            <addressOffset>0x14034</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0xD5</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>US_OFFSET</name>
                <description>During slave connection event, HW updates this register with the calculated us_offset at anchor point, granularity is 1us. The reset value is 0x0000. After reset deassertion, then the very next clock, the value assigned to the registers is 0x00D5.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ACCU_WINDOW_WIDEN_STATUS</name>
            <description>Accumulated Window Widen Status</description>
            <addressOffset>0x14038</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ACCU_WINDOW_WIDEN</name>
                <description>Accumulated Window Widen Value. HW updates this register at the close of slave connection event</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EARLY_INTR_STATUS</name>
            <description>Status when early interrupt is raised</description>
            <addressOffset>0x1403C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_INDEX_FOR_EARLY_INTR</name>
                <description>Connection Index for which early interrupt is raised</description>
                <bitRange>[4:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CONN_TYPE_FOR_EARLY_INTR</name>
                <description>Connection type for which early interrupt is raised.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>US_FOR_EARLY_INTR</name>
                <description>US offset when early interrupt is raised</description>
                <bitRange>[15:6]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_CONFIG</name>
            <description>Multi-Master Multi-Slave Config</description>
            <addressOffset>0x14040</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FF</resetMask>
            <fields>
              <field>
                <name>MMMS_ENABLE</name>
                <description>Configuration bit to enable MMMS functionality</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DISABLE_CONN_REQ_PARAM_IN_MEM</name>
                <description>If set to 1'b1 and MMMS enabled, then the parameters received in connection request are not stored in CONN_REQ_PARAM memory. By default this bit is 1'b0 and the connection request parameters are stored in connection memory.
This bit is intended as a fail-safe. Should not be changed dynamically during runtime</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DISABLE_CONN_PARAM_MEM_WR</name>
                <description>By default on end_ce, the connection parameters memory is loaded with the updated connection parameters. Setting this bit prevent's this update.
This bit is intended as a fail-safe. Should not be changed dynamically during runtime</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_PARAM_FROM_REG</name>
                <description>By default the parameters for the connection are picked up from the connection parameters memory. Setting this bit disables this and the parameters are picked up from registers
0 - HW loads the parameters from connection memory
1 - Firmware should program the paramters for the connection event
This bit is intended as a fail-safe. Should not be changed dynamically during runtime</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_CONN_INDEX</name>
                <description>This field specifies the connection index for which ADV is enabled</description>
                <bitRange>[8:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CE_LEN_IMMEDIATE_EXPIRE</name>
                <description>Enable for CE length immediate expiry</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESET_RX_FIFO_PTR</name>
                <description>Setting this bit resets the receive FIFO pointers</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>US_COUNTER</name>
            <description>Running US of the current BT Slot</description>
            <addressOffset>0x14044</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>US_COUNTER</name>
                <description>Current value of the US Counter</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>US_CAPT_PREV</name>
            <description>Previous captured US of the BT Slot</description>
            <addressOffset>0x14048</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>US_CAPT_LOAD</name>
                <description>HW uses this register to load the us_offset from connection parameter memory. This can be used by firmware as a fail safe option if the HW load from memory is disabled. In alll other conditions firmware should not use this register.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EARLY_INTR_NI</name>
            <description>NI at early interrupt</description>
            <addressOffset>0x1404C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>EARLY_INTR_NI</name>
                <description>Connection Next instant when the early interrupt is triggered</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_MASTER_CREATE_BT_CAPT</name>
            <description>BT slot capture for master connection creation</description>
            <addressOffset>0x14080</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>BT_SLOT</name>
                <description>This register captures the BT_SLOT when master connection is created, granularity is 625us</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_SLAVE_CREATE_BT_CAPT</name>
            <description>BT slot capture for slave connection creation</description>
            <addressOffset>0x14084</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>US_CAPT</name>
                <description>This register captures the BT_SLOT when slave connection is created, granularity is 625us</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_SLAVE_CREATE_US_CAPT</name>
            <description>Micro second capture for slave connection creation</description>
            <addressOffset>0x14088</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>US_OFFSET_SLAVE_CREATED</name>
                <description>This register captures the us when slave connection is created, granularity is 1us</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>16</dim>
            <dimIncrement>4</dimIncrement>
            <name>MMMS_DATA_MEM_DESCRIPTOR[%s]</name>
            <description>Data buffer descriptor 0 to 15</description>
            <addressOffset>0x14100</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>LLID_C1</name>
                <description>N/A</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_LENGTH_C1</name>
                <description>This field indicates the length of the data packet. Bits [9:7] are valid only if DLE is set.
Range 0x00 to 0xFF.</description>
                <bitRange>[9:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_1_DATA_LIST_SENT</name>
            <description>data list sent update and status for connection 1</description>
            <addressOffset>0x14200</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF8F</resetMask>
            <fields>
              <field>
                <name>LIST_INDEX__TX_SENT_3_0_C1</name>
                <description>Write:Indicates the buffer index for which the SENT bit is being updated by firmware.
The default number of buffers in the IP is 5. The index range is 0-3.

