cmsis-svd/cmsis-svd/data/Cypress/psoc63.svd
1 - MD bit is exclusively controlled by software, based on status of bit [6].

0 - MD Bit in the transmitted PDU is controlled by software and hardware logic. MD bit is set in transmitted packet, only if the software has set the MD in bit [6] and either of the following conditions is true,
a) If there are packets queued for transmission.
b) If there is an acknowledgement awaited from the remote side for the packet transmitted.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PAUSE_DATA_C1</name>
                <description>Pause data. 
1 - pause data, 
0 - do not pause.
The current_pdu_index in hardware does not move to next in-dex until pause_data is cleared.
But if the SENT bit is set for the current_pdu_index as which pause is set, data will be sent out</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>KILL_CONN</name>
                <description>Kills the connection immediately when the connection event is active</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>KILL_CONN_AFTER_TX</name>
                <description>Kills the connection when the connection event is active and a TX is completed</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EMPTYPDU_SENT</name>
                <description>This bit indicates if EMPTYPDU has been sent. IF ACK is received this bit will be cleared by HW</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CURRENT_PDU_INDEX_C1</name>
                <description>The index of the transmit packet buffer that is currently in transmission/waiting for transmission.</description>
                <bitRange>[15:12]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_ADVCH_NI_ENABLE</name>
            <description>Enable bits for ADV_NI, SCAN_NI and INIT_NI</description>
            <addressOffset>0x14400</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>ADV_NI_ENABLE</name>
                <description>This bit is used to enable the Advertisement NI timer and is valid when MMMS_ENABLE=1.
0 - ADV_NI  timer is disabled
1 - ADV_NI timer is enabled

In this mode, the adv engine next instant is scheduled by firmware</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_NI_ENABLE</name>
                <description>This bit is used to enable the SCAN NI timer and is valid when MMMS_ENABLE=1.
0 - SCAN_NI  timer is disabled
1 - SCAN_NI timer is enabled

In this mode, the scan engine next instant is scheduled by firmware</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_NI_ENABLE</name>
                <description>This bit is used to enable the INIT NI timer and is valid when MMMS_ENABLE=1.
0 - INIT_NI  timer is disabled
1 - INIT_NI timer is enabled

In this mode, the init engine next instant is scheduled by firmware</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_ADVCH_NI_VALID</name>
            <description>Next instant valid for ADV, SCAN, INIT</description>
            <addressOffset>0x14404</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>ADV_NI_VALID</name>
                <description>This bit indicates if the programmed advertisement NI_TIMER is valid. FW sets this bit to indicate that the NI_TIMER is programmed. HW clears this bit on servicing the advertisment event
0 - ADV_NI timer is not valid 
1 - ADV_NI timer is valid</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_NI_VALID</name>
                <description>This bit indicates if the programmed scan NI_TIMER is valid. FW sets this bit to indicate that the NI_TIMER is programmed. HW clears this bit on servicing the scanner event
0 - SCAN_NI timer is not valid 
1 - SCAN_NI timer is valid</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_NI_VALID</name>
                <description>This bit indicates if the programmed initiator NI_TIMER is valid. FW sets this bit to indicate that the NI_TIMER is programmed. HW clears this bit on servicing the initiator event
0 - INIT_NI timer is not valid 
1 - INIT_NI timer is valid</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_ADVCH_NI_ABORT</name>
            <description>Abort the next instant of ADV, SCAN, INIT</description>
            <addressOffset>0x14408</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>ADVCH_NI_ABORT</name>
                <description>FW can use this bit to clear an unserviced NI_VALID for Advertisement or scanner or initiator. HW will clear NI_VALID for ADV/SCAN/INIT if the event has not yet started</description>
                <bitRange>[0:0]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>ADVCH_ABORT_STATUS</name>
                <description>The link layer hardware logic will set this bit when the NI_TIMER is aborted. Firmware to clear this by writing 1'b1 to this register bit</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_PARAM_NEXT_SUP_TO</name>
            <description>Register to configure the supervision timeout for next scheduled connection</description>
            <addressOffset>0x14410</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>NEXT_SUP_TO_LOAD</name>
                <description>HW uses this register to load the Supervision timeout Next instant from the connection memory. This can be used by firmware as a failsafe option when the hardware load is disabled. In all other conditions, this register should not be updated by firmware.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_PARAM_ACC_WIN_WIDEN</name>
            <description>Register to configure Accumulated window widening for next scheduled connection</description>
            <addressOffset>0x14414</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>ACC_WINDOW_WIDEN</name>
                <description>HW uses this register to load the accumulated window windeing value from the connection memory. This can be used by firmware as a failsafe option when the hardware load is disabled. In all other conditions, this register should not be updated by firmware.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HW_LOAD_OFFSET</name>
            <description>Register to configure offset from connection anchor point at which connection parameter memory should be read</description>
            <addressOffset>0x14420</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x4</resetValue>
            <resetMask>0x1F</resetMask>
            <fields>
              <field>
                <name>LOAD_OFFSET</name>
                <description>Load Offset in us before connection event at which the connection parameters are loaded from memory, granularity is in 1us</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_RAND</name>
            <description>Random number generated by Hardware for ADV NI calculation</description>
            <addressOffset>0x14424</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x7</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>ADV_RAND</name>
                <description>Random ADV delay, to be used for ADV next instant calculation. The granularity is in BT slot</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MMMS_RX_PKT_CNTR</name>
            <description>Packet Counter of packets in RX FIFO in MMMS mode</description>
            <addressOffset>0x14428</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>MMMS_RX_PKT_CNT</name>
                <description>Count of all packets in the RX FIFO in MMMS mode</description>
                <bitRange>[5:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>4</dimIncrement>
            <name>CONN_RX_PKT_CNTR[%s]</name>
            <description>Packet Counter for Individual connection index</description>
            <addressOffset>0x14430</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>RX_PKT_CNT</name>
                <description>Number of packets received for the connection. Incremented when the packet is received during the connection event and decremented when firmware has processed the packet.  The register field FW_PKT_RCV_CONN_INDEX should be programmed before firmware issues the packet received command</description>
                <bitRange>[5:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WHITELIST_BASE_ADDR</name>
            <description>Whitelist base address</description>
            <addressOffset>0x14800</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>WL_BASE_ADDR</name>
                <description>Device address values written to white list memory are written as 16-bit wide address.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RSLV_LIST_PEER_IDNTT_BASE_ADDR</name>
            <description>Resolving list base address for storing Peer Identity address</description>
            <addressOffset>0x148C0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RSLV_LIST_PEER_IDNTT_BASE_ADDR</name>
                <description>Device address values written to the list are written as 16-bit wide address.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RSLV_LIST_PEER_RPA_BASE_ADDR</name>
            <description>Resolving list base address for storing resolved Peer RPA address</description>
            <addressOffset>0x14980</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RSLV_LIST_PEER_RPA_BASE_ADDR</name>
                <description>Device address values written to the list are written as 16-bit wide address.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR</name>
            <description>Resolving list base address for storing Resolved received INITA RPA</description>
            <addressOffset>0x14A40</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR</name>
                <description>Device address values written to the list are written as 16-bit wide address.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RSLV_LIST_TX_INIT_RPA_BASE_ADDR</name>
            <description>Resolving list base address for storing generated TX INITA RPA</description>
            <addressOffset>0x14B00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RSLV_LIST_TX_INIT_RPA_BASE_ADDR</name>
                <description>Device address values written to the list are written as 16-bit wide address.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>BLESS</name>
          <description>Bluetooth Low Energy Subsystem Miscellaneous</description>
          <addressOffset>0x0001F000</addressOffset>
          <register>
            <name>DDFT_CONFIG</name>
            <description>BLESS DDFT configuration register</description>
            <addressOffset>0x60</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F1F03</resetMask>
            <fields>
              <field>
                <name>DDFT_ENABLE</name>
                <description>Enables the DDFT output from BLESS
1: DDFT is enabled
0: DDFT is disabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BLERD_DDFT_EN</name>
                <description>Enables the DDFT inputs from CYBLERD55 chip
1: DDFT inputs are enabled
0: DDFT inputs are disabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DDFT_MUX_CFG1</name>
                <description>dbg_mux_pin1 selection, combine with BLERD and BLESS
5'h00 blerd_ddft_out[0]
5'h01 rcb_tx_fifo_empty
5'h02 hv_ldo_lv_detect_raw
5'h03 dbus_rx_en
5'h04 1'b0
5'h05 clk_switch_to_sysclk
5'h06 ll_clk_en_sync
5'h07 dsm_entry_stat
5'h08 proc_tx_en
5'h09 rssi_read_start
5'h0A tx_2mbps
5'h0B rcb_bus_busy
5'h0C hv_ldo_en_mt (act_stdbyb)
5'h0D ll_eco_clk_en
5'h0E blerd_reset_assert
5'h0F hv_ldo_byp_n
5'h10 hv_ldo_lv_detect_mt
5'h11 enable_ldo
5'h12 enable_ldo_dly
5'h13 bless_rcb_le_out
5'h14 bless_rcb_clk_out
5'h15 bless_dig_ldo_on_out
5'h16 bless_act_ldo_en_out
5'h17 bless_clk_en_out
5'h18 bless_buck_en_out
5'h19 bless_ret_switch_hv_out
5'h1A efuse_rw_out
5'h1B efuse_avdd_out
5'h1C efuse_config_efuse_mode
5'h1D bless_dbus_tx_en_pad
5'h1E bless_bpktctl_rd
5'h1F 1'b0</description>
                <bitRange>[12:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DDFT_MUX_CFG2</name>
                <description>dbg_mux_pin2 selection, combine with BLERD and BLESS
5'h00 blerd_ddft_out[1]
5'h01 rcb_rx_fifo_empty
5'h02 ll_decode_rxdata
5'h03 dbus_tx_en
5'h04 fw_clk_en
5'h05 interrupt_ll_n
5'h06 llh_st_sm
5'h07 llh_st_dsm
5'h08 proc_rx_en
5'h09 rssi_rx_done
5'h0A rx_2mbps
5'h0B rcb_ll_ctrl
5'h0C hv_ldo_byp_n
5'h0D reset_deassert
5'h0E rcb_intr
5'h0F rcb_ll_intr
5'h10 hv_ldo_en_mt (act_stdbyb)
5'h11 hv_ldo_lv_detect_raw
5'h12 bless_rcb_data_in
5'h13 bless_xtal_en_out 
5'h14 bless_isolate_n_out 
5'h15 bless_reset_n_out
5'h16 bless_ret_ldo_ol_hv_out
5'h17 bless_txd_rxd_out
5'h18 tx_rx_ctrl_sel
5'h19 bless_bpktctl_cy
5'h1A efuse_cs_out
5'h1B efuse_pgm_out 
5'h1C efuse_sclk_out
5'h1D hv_ldo_lv_detect_mt
5'h1E enable_ldo
5'h1F enable_ldo_dly</description>
                <bitRange>[20:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XTAL_CLK_DIV_CONFIG</name>
            <description>Crystal clock divider configuration register</description>
            <addressOffset>0x64</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>SYSCLK_DIV</name>
                <description>System clock pre-divider value. The 24 MHz crystal clock is divided to generate the system clock.
0: NO_DIV:   SYSCLK= XTALCLK/1
1: DIV_BY_2: SYSCLK= XTALCLK/2
2: DIV_BY_4: SYSCLK= XTALCLK/4
3: DIV_BY_8: SYSCLK= XTALCLK/8</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LLCLK_DIV</name>
                <description>Link Layer clock pre-divider value. The 24 MHz crystal clock is divided to generate the Link Layer clock.
0: NO_DIV:   LLCLK= XTALCLK/1
1: DIV_BY_2: LLCLK= XTALCLK/2
2: DIV_BY_4: LLCLK= XTALCLK/4
3: DIV_BY_8: LLCLK= XTALCLK/8</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
