cmsis-svd/cmsis-svd/data/Cypress/psoc63.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PDM0</name>
      <description>PDM registers</description>
      <headerStructName>PDM</headerStructName>
      <baseAddress>0x42A20000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20808</resetValue>
          <resetMask>0x80030F0F</resetMask>
          <fields>
            <field>
              <name>PGA_R</name>
              <description>Right channel PGA gain:
+1.5dB/step, -12dB ~ +10.5dB
'0': -12 dB
'1': -10.5 dB 
...
'15' +10.5 dB
(Note: These bits are connected to AR36U12.PDM_CORE_CFG.PGA_R)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGA_L</name>
              <description>Left channel PGA gain:
+1.5dB/step, -12dB ~ +10.5dB
'0': -12 dB
'1': -10.5 dB 
...
'15': +10.5 dB
(Note: These bits are connected to AR36U12.PDM_CORE_CFG.PGA_L)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFT_MUTE</name>
              <description>Soft mute function to mute the volume smoothly
'0': Disabled.
'1': Enabled.
(Note: This bit is connected to AR36U12.PDM_CORE_CFG.SOFT_MUTE)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_SEL</name>
              <description>Set fine gain step for smooth PGA or Soft-Mute attenuation transition.
'0': 0.13dB
'1': 0.26dB
(Note: This bit is connected to AR36U12.PDM_CORE2_CFG.SEL_STEP)</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>Enables the PDM component:
'0': Disabled.
'1': Enabled.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_CTL</name>
          <description>Clock control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200310</resetValue>
          <resetMask>0x7F0F33</resetMask>
          <fields>
            <field>
              <name>CLK_CLOCK_DIV</name>
              <description>PDM CLK (FPDM_CLK) (1st divider):
This configures a frequency of PDM CLK. The configured frequency is used to operate PDM core. I.e. the frequency is input to MCLKQ_CLOCK_DIV register.

Note: configure a frequency of PDM CLK as lower than or equal 50MHz with this divider.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVBY1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY2</name>
                  <description>Divide by 2 (no 50 percent duty cycle)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY3</name>
                  <description>Divide by 3 (no 50 percent duty cycle)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY4</name>
                  <description>Divide by 4 (no 50 percent duty cycle)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCLKQ_CLOCK_DIV</name>
              <description>MCLKQ divider (2nd divider)

(Note: These bits are connected to 
AR36U12.PDM_CORE2_CFG.DIV_MCLKQ)</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVBY1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY2</name>
                  <description>Divide by 2 (no 50 percent duty cycle)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY3</name>
                  <description>Divide by 3 (no 50 percent duty cycle)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY4</name>
                  <description>Divide by 4 (no 50 percent duty cycle)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKO_CLOCK_DIV</name>
              <description>PDM CKO (FPDM_CKO) clock divider (3rd divider):
FPDM_CKO = MCLKQ / (CKO_CLOCK_DIV + 1)

Note: To configure '0' to this field is prohibited.
(Note: PDM_CKO is configured by MCLKQ_CLOCK_DIV,  CLK_CLOCK_DIV and CKO_CLOCK_DIV. )
(Note: These bits are connected to 
AR36U12.PDM_CORE_CFG.MCLKDIV)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SINC_RATE</name>
              <description>SINC Decimation Rate. For details, see the data sheet provided by Archband.
Oversampling Ratio = Decimation Rate = 2 X SINC_RATE
(Note: These bits are connected to AR36U12.PDM_CORE_CFG.SINC_RATE)</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE_CTL</name>
          <description>Mode control</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1B000103</resetValue>
          <resetMask>0x1F070707</resetMask>
          <fields>
            <field>
              <name>PCM_CH_SET</name>
              <description>Specifies PCM output channels as mono or stereo:

